Словарь/src/Catalogs/Словарь/Словарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Словарь</name>
  <attributes>
    <name>ЗаписьНаЯпонском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расшифровка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСлова</name>
    <type>
      <types>EnumRef.ВидыСлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйСлог</name>
    <type>
      <types>CatalogRef.Слоги</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Слог</name>
      <type>
        <types>CatalogRef.Слоги</types>
      </type>
    </attributes>
    <attributes>
      <name>Запись</name>
      <type>
        <types>EnumRef.ВидыКаны</types>
      </type>
    </attributes>
    <attributes>
      <name>Канджи</name>
      <type>
        <types>CatalogRef.Канджи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставНовый</name>
    <attributes>
      <name>Моджи</name>
      <type>
        <types>CatalogRef.Моджи</types>
      </type>
    </attributes>
    <attributes>
      <name>Запись</name>
      <type>
        <types>EnumRef.ВидыКаны</types>
      </type>
    </attributes>
    <attributes>
      <name>Канджи</name>
      <type>
        <types>CatalogRef.Канджи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Словарь/src/Catalogs/Словарь/ManagerModule.bsl
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Добавить("Наименование");
	Поля.Добавить("ЗаписьНаЯпонском");
	Поля.Добавить("Комментарий");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Данные.Наименование) Тогда
		Представление = "Словарь (новый)";	
	Иначе
		ТокеныЗначение = СтрРазделить(Данные.Комментарий, "(.;", Ложь);
		Если ТокеныЗначение.Количество() = 0 Тогда
			Значение = "(не указан перевод)";
		Иначе
			Значение = ТокеныЗначение[0];
		КонецЕсли;
		Представление = СтрШаблон("%1 (%2) - %3", Данные.Наименование, Данные.ЗаписьНаЯпонском, Значение);
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
